of+1806/src/solvers/debugSolverThermFunModels/run_debugSolverThermFunModels/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{ 

	rho		rho [1 -3 0 0 0 0 0] 900.;
	etaS		etaS [1 -1 -1 0 0 0 0] 0.1;
	etaP		etaP [1 -1 -1 0 0 0 0] 0.9;                               
	lambda		lambda [0 0 1 0 0 0 0] 1;
	
	type		PTTexp;
        epsilon		epsilon [0 0 0 0 0 0 0] 0.02;  
        zeta		zeta [0 0 0 0 0 0 0] 0.;

	//type		FENE-CR;
	//L2		L2 [0 0 0 0 0 0 0] 100;
	//solveInTau	true;
	//modifiedForm	false;

	//stabilization none;
	stabilization	coupling;
}

passiveScalarProperties {
	solvePassiveScalar	false;
	D			D [ 0 2 -1 0 0 0 0 ] 2e-3;
}

thermophysicalProperties {
	T0		T0 [0 0 0 1 0 0 0] 450;
   
   	ktThermFun	constant;
	ktThermFunCoefficients {
	  kt0		kt0 [1 1 -3 -1 0 0 0] 8e-2;
	};

	cpThermFun	LinearFit;
	cpThermFunCoefficients {
	  cp0		cp0 [0 2 -2 -1 0 0 0] 400.; 
	  c1		c1 [0 0 0 0 0 0 0] 0.9994;
	  c2		c2 [0 0 0 -1 0 0 0] -0.00112;
	};

	etaThermFun    Arrhenius;
	etaThermFunCoefficients {
	  eta0          eta0   [1 -1 -1 0 0 0 0]       10.;
	  c1            c1      [0  0  0 1 0 0 0]       1.72e3;
	};

	lambdaThermFun    WLF;
	lambdaThermFunCoefficients {
	  lambda0       lambda0 [0  0  1 0 0 0 0]       0.1;
	  c1            c1      [0  0  0 0 0 0 0]       4.54;
	  c2            c2      [0  0  0 1 0 0 0]       150.36;
	};

}

}
// ************************************************************************* //
